In [2]:
# import the pandas library
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])
print( df)
df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

print( df)
print (df['one'].median())
print (df['one'].isnull())
#Total missing value for each attribute
print (df.isnull().sum())
#any missing values?
print (df['one'].isnull().values.any())
#Total no. of missing values
print (df.isnull().sum().sum())

        one       two     three
a -0.384251 -0.739179  0.519800
c -0.255020  0.239748 -1.947849
e  0.423386 -0.655043  0.302826
f  0.787244 -0.655733  0.755614
h  0.776467  0.556930  0.749111
        one       two     three
a -0.384251 -0.739179  0.519800
b       NaN       NaN       NaN
c -0.255020  0.239748 -1.947849
d       NaN       NaN       NaN
e  0.423386 -0.655043  0.302826
f  0.787244 -0.655733  0.755614
g       NaN       NaN       NaN
h  0.776467  0.556930  0.749111
0.4233858673648557
a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool
one      3
two      3
three    3
dtype: int64
True
9

In [2]:
print ("NaN replaced with '0':")
print( df.fillna(0))

NaN replaced with '0':
        one       two     three
a -0.429331 -0.333517 -0.005936
b  0.000000  0.000000  0.000000
c  1.465223 -0.357682 -0.544862
d  0.000000  0.000000  0.000000
e  0.195509 -0.416033 -1.483304
f -0.938708 -0.481172  2.519897
g  0.000000  0.000000  0.000000
h  1.661320  2.222215 -0.340729

In [3]:
print(df)
print( df.fillna(method='pad'))

        one       two     three
a -0.429331 -0.333517 -0.005936
b       NaN       NaN       NaN
c  1.465223 -0.357682 -0.544862
d       NaN       NaN       NaN
e  0.195509 -0.416033 -1.483304
f -0.938708 -0.481172  2.519897
g       NaN       NaN       NaN
h  1.661320  2.222215 -0.340729
        one       two     three
a -0.429331 -0.333517 -0.005936
b -0.429331 -0.333517 -0.005936
c  1.465223 -0.357682 -0.544862
d  1.465223 -0.357682 -0.544862
e  0.195509 -0.416033 -1.483304
f -0.938708 -0.481172  2.519897
g -0.938708 -0.481172  2.519897
h  1.661320  2.222215 -0.340729

In [4]:
print(df)
print( df.fillna(method='bfill'))

        one       two     three
a -0.429331 -0.333517 -0.005936
b       NaN       NaN       NaN
c  1.465223 -0.357682 -0.544862
d       NaN       NaN       NaN
e  0.195509 -0.416033 -1.483304
f -0.938708 -0.481172  2.519897
g       NaN       NaN       NaN
h  1.661320  2.222215 -0.340729
        one       two     three
a -0.429331 -0.333517 -0.005936
b  1.465223 -0.357682 -0.544862
c  1.465223 -0.357682 -0.544862
d  0.195509 -0.416033 -1.483304
e  0.195509 -0.416033 -1.483304
f -0.938708 -0.481172  2.519897
g  1.661320  2.222215 -0.340729
h  1.661320  2.222215 -0.340729

In [5]:
print(df)
print( df.dropna())

        one       two     three
a -0.429331 -0.333517 -0.005936
b       NaN       NaN       NaN
c  1.465223 -0.357682 -0.544862
d       NaN       NaN       NaN
e  0.195509 -0.416033 -1.483304
f -0.938708 -0.481172  2.519897
g       NaN       NaN       NaN
h  1.661320  2.222215 -0.340729
        one       two     three
a -0.429331 -0.333517 -0.005936
c  1.465223 -0.357682 -0.544862
e  0.195509 -0.416033 -1.483304
f -0.938708 -0.481172  2.519897
h  1.661320  2.222215 -0.340729

In [6]:
#Interpolation of immediate data before and after it (average is taken)

print(df.interpolate())

        one       two     three
a -0.429331 -0.333517 -0.005936
b  0.517946 -0.345599 -0.275399
c  1.465223 -0.357682 -0.544862
d  0.830366 -0.386858 -1.014083
e  0.195509 -0.416033 -1.483304
f -0.938708 -0.481172  2.519897
g  0.361306  0.870522  1.089584
h  1.661320  2.222215 -0.340729

In [3]:
import pandas as pd

df = pd.read_csv("train.csv")
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [8]:
to_drop = ['Gender','Married']
#df.drop(columns=to_drop, inplace=True)
df.drop(to_drop, inplace=True, axis=1)

In [9]:
df.head()

,Loan_ID,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [4]:
df = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})
df

     brand  rating style
0  Yum Yum     4.0   cup
1  Yum Yum     4.0   cup
2  Indomie     3.5   cup
3  Indomie    15.0  pack
4  Indomie     5.0  pack

In [5]:
df.drop_duplicates()

     brand  rating style
0  Yum Yum     4.0   cup
2  Indomie     3.5   cup
3  Indomie    15.0  pack
4  Indomie     5.0  pack

In [6]:
#To remove duplicates on specific column(s), use subset.
df.drop_duplicates(subset=['brand'])

     brand  rating style
0  Yum Yum     4.0   cup
2  Indomie     3.5   cup

In [7]:
#To remove duplicates on specific column(s), use subset.
#to remove duplicates and keep last occurrences, use keep.
df.drop_duplicates(subset=['brand', 'style'], keep='last')

     brand  rating style
1  Yum Yum     4.0   cup
2  Indomie     3.5   cup
4  Indomie     5.0  pack

In [ ]:
#https://pandas.pydata.org/docs/reference/frame.html